src/src/AccumulationRegisters/GoodsShippedNotInvoiced.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>GoodsShippedNotInvoiced</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GoodsIssue</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GoodsIssue</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Products</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsBatches</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/AccumulationRegisters/GoodsShippedNotInvoiced/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	GoodsShippedNotInvoiced.LineNumber AS LineNumber,
	|	GoodsShippedNotInvoiced.Company AS Company,
	|	GoodsShippedNotInvoiced.GoodsIssue AS GoodsIssue,
	|	GoodsShippedNotInvoiced.Counterparty AS Counterparty,
	|	GoodsShippedNotInvoiced.Contract AS Contract,
	|	GoodsShippedNotInvoiced.Products AS Products,
	|	GoodsShippedNotInvoiced.Characteristic AS Characteristic,
	|	GoodsShippedNotInvoiced.Batch AS Batch,
	|	GoodsShippedNotInvoiced.SalesOrder AS SalesOrder,
	|	GoodsShippedNotInvoiced.Quantity AS QuantityBeforeWrite,
	|	GoodsShippedNotInvoiced.Quantity AS QuantityChange,
	|	GoodsShippedNotInvoiced.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsGoodsShippedNotInvoicedChange
	|FROM
	|	AccumulationRegister.GoodsShippedNotInvoiced AS GoodsShippedNotInvoiced");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsGoodsShippedNotInvoicedChange", False);
	
EndProcedure

#EndRegion

#EndIf
